#+title: 减肥记录
#+date: 2025-01-19T19:50:02+01:00
#+lastmod: 2025-01-19T19:50:02+01:00
# ISO 8601 date use output from
# C-u M-! date -Iseconds
#+draft: false
#+tags[]:

记录自己减肥的进度。包含跑步统计和饮食统计。

# more
* 目标
身高179厘米的目标是64公斤。这个目标对应BMI=20.0。


* 跑步

我争取每天跑七公里，用时45分钟。跑步是使用手表和GadgetBridge记录的。

| 日期             | 里程 公里 | 体重 公斤 |
|------------------+-----------+-----------|
| <2025-01-19 Sun> |     142.6 |      71.2 |

* 饮食

若未另外说明，均以百克为单位。
植物油以百毫升为单位。
鸡蛋以颗为单位，估计每颗去壳50g。
用 =C-c }= 显示表格调试模式。

在修改计算函数后，用 =C-u C-c C-c= 来重新计算结果。

目标为每天9000kJ。越少越好。

** 二五年一月

*** <2025-01-19 Sun>
| 食品     | 单位 | 单位kJ | 用量 |  用量kJ |
|----------+------+--------+------+---------|
| 半熟米   | 百克 |   1485 |  4.5 |  6682.5 |
| 土豆     | 百克 |    364 |    3 |    1092 |
| 干豆类   | 百克 |   1514 |    1 |    1514 |
| 白菜     | 百克 |    103 |    5 |     515 |
| 全麦面条 | 百克 |   1422 |    0 |       0 |
| 瓜子油   | 百ml |   3400 |  0.6 |   2040. |
| 鸡蛋去壳 | 百克 |    647 |    0 |       0 |
| 洋葱     | 百克 |    166 |    0 |       0 |
| 苹果     | 百克 |    218 |    0 |       0 |
| 香蕉去皮 | 百克 |    371 |    0 |       0 |
| 橙子     | 百克 |    197 |    0 |       0 |
| 其他     | kJ   |      1 |    0 |       0 |
|----------+------+--------+------+---------|
| 总计     |      |        |      | 11843.5 |
#+TBLFM: @>$5=vsum(@I$5..@II$5);::@<<$5..@>>$5=($3 $4)

# comment:
# @>$5=vsum(@I$5..@II$5)
# @> refers to the last row, $5 refers to the fifth col
# @I..@II refers to the region between first hline and second hline
# @I$5..@II$5 refers to the region of fifth col between first hline and second hline

# @<<$5..@>>$5=($3 $4)
# @<<..@>> refers to the region between third line and third to last line.
# excluding first and last two lines.
